Revit 2026 API

# KeyBasedTreeEntriesLoadContentBuildEntries Method

---

Builds a KeyBasedTreeEntries object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void BuildEntries()
```
```vb
Public Sub BuildEntries
```
```cpp
public:
void BuildEntries()
```
```fsharp
member BuildEntries : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The KeyBasedTreeEntries object owned by this KeyBasedTreeEntriesLoadContent object is built already. Adding more KeyBasedTreeEntries as well as repeated building, is not supported. |

This method will take all the entries that have been added, create a KeyBasedTreeEntries object out of these entries, and also record possible errors that occurred while constructing this KeyBasedTreeEntries object. After this function is called, no more entries can be added. And repeated calling of this function is not allowed either.

#### Reference

KeyBasedTreeEntriesLoadContent Class

Autodesk.Revit.DB Namespace